app/controllers/api/notes_controller.rb

  def index
    notebook = Notebook.find(params[:notebook_id])
---
SELECT  "notebooks".* FROM "notebooks" WHERE "notebooks"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]

  def create
    @note = Note.new(note_params)
    if @note.save
---
INSERT INTO "notes" ("notebook_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["notebook_id", 20], ["title", "Note 3"], ["created_at", "2021-12-02 22:11:06.529239"], ["updated_at", "2021-12-02 22:11:06.529239"]]

  def destroy
    @note = Note.find(params[:note][:id])
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]

  def update
    @note = Note.find(params[:note][:id])
    if @note.update(note_params)
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "notes" SET "body" = $1, "updated_at" = $2 WHERE "notes"."id" = $3  [["body", "<p>Autosave b</p>"], ["updated_at", "2021-12-17 02:20:58.421308"], ["id", 15]]