app/controllers/api/notebooks_controller.rb

  def show
    @notebook = Notebook.find(params[:notebook][:id])
---
SELECT  "notebooks".* FROM "notebooks" WHERE "notebooks"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]

  def create
    @notebook = Notebook.new(notebook_params)
    @notebook.author_id = current_user.id
    if @notebook.save
---
INSERT INTO "notebooks" ("author_id", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 8], ["title", "owen"], ["description", "owen"], ["created_at", "2021-11-30 18:52:27.555642"], ["updated_at", "2021-11-30 18:52:27.555642"]]

  def destroy
    @notebook = Notebook.find(params[:notebook][:id])
    @notebook.destroy!
---
SELECT  "notebooks".* FROM "notebooks" WHERE "notebooks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notebooks" WHERE "notebooks"."id" = $1  [["id", 1]]